src/cf/Catalogs/Б24_НастройкиСинхронизацииСБитрикс24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Б24_НастройкиСинхронизацииСБитрикс24</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизацияКонтрагентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизацияСделок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизацияСчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизацияТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Портал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиСинхронизации</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСинхронизацииДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПовторенийПриОшибках</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизацияЗаказов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРегистрироватьИзмененияАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВыполненияСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СопоставлениеПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдПользователя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь1С</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/КомпанияЧастноеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>КомпанияЧастноеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Компания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ВидыЦен</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриПродаже</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриПередачеМеждуОрганизациями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриВыпускеПродукции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаданияЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаданияЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорогСрабатывания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеСхемыКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Округлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьЦенуПриВводеНаОсновании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриПередачеПродукцииДавальцу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОкругления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦС_Пересчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦС_Промоутер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦС_РегМенеджер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦС_Кассир</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦС_Кладовщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДействияВидовЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВлияющиеВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВлияющийВидЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦеновыеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПравилаОкругленияЦены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НижняяГраницаДиапазонаЦен</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочностьОкругления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПсихологическоеОкругление</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПорогиСрабатывания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорогСрабатывания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Б24_ПользовательскиеГруппыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Б24_ПользовательскиеГруппыТоваров</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРаздела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инфоблок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Б24_НастройкиСинхронизацииСБитрикс24/Ext/ManagerModule.bsl
#Область Прочее

Функция Версия() Экспорт
	Возврат Б24_ОбщегоНазначенияСервер.Версия();	
КонецФункции

Функция ПроверкаОбновленияДанныхМодуляОбменаСБитрикс24() Экспорт
	Возврат Б24_ОбщегоНазначенияСервер.ПроверкаОбновленияДанныхМодуляОбменаСБитрикс24();	
КонецФункции

Процедура ДобавитьНастройкуВСтруктуру(СтруктураНастроек, НазваниеНастройки, ЗначениеНастройки) Экспорт
	
	Если СтруктураНастроек.Свойство(НазваниеНастройки) тогда
		СтруктураНастроек[НазваниеНастройки] = ЗначениеНастройки;	
	Иначе
		СтруктураНастроек.Вставить(НазваниеНастройки, ЗначениеНастройки);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруСхемКомпоновки() Экспорт
	
	Результат = Новый Структура();
	                                      
	Результат.Вставить("Компании"			, Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("СхемаВыгрузкиКомпаний")); 	
	Результат.Вставить("Контакты"			, Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("СхемаВыгрузкиКонтактов")); 	
	Результат.Вставить("Реквизиты"			, Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("СхемаВыгрузкиРеквизитов")); 	
	Результат.Вставить("Адреса"				, Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("СхемаВыгрузкиАдресов")); 	
	Результат.Вставить("БанкСчета"			, Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("СхемаВыгрузкиБанковскихСчетов")); 	
	
	Результат.Вставить("Товары"				, Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("СхемаВыгрузкиТоваров")); 	
	Результат.Вставить("ЕдиницыИзмерения"	, Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("СхемаВыгрузкиЕдиницИзмерения")); 	
	Результат.Вставить("СвойстваТоваров"	, Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("СхемаВыгрузкиСвойствТоваров")); 	
	
	Результат.Вставить("Счета"				, Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("СхемаВыгрузкиСчетов")); 	
	Результат.Вставить("Сделки"				, Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("СхемаВыгрузкиСделок")); 	
	Результат.Вставить("Заказы"				, Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("СхемаВыгрузкиЗаказов")); 	
	Результат.Вставить("Отгрузки"			, Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("СхемаВыгрузкиОтгрузок")); 	
	Результат.Вставить("Оплаты"				, Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("СхемаВыгрузкиОплат")); 	
		
	Результат.Вставить("ПользовательскиеПоля", Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("СхемаВыгрузкиПользовательскихПолей")); 	
	
	Результат.Вставить("СвойстваЗаказов"	 , Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьМакет("СхемаВыгрузкиСвойствЗаказов")); 	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНастройкиСинхронизацииПоУмолчанию() Экспорт
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	
	СтруктураССхемами = Справочники.Б24_НастройкиСинхронизацииСБитрикс24.ПолучитьСтруктуруСхемКомпоновки();
	
	НастройкиОбмена = Новый Структура;
	
		НастройкиСинхронизацииТоваров = Новый Структура;
		НастройкиСинхронизацииТоваров.Вставить("ВыгружатьТовары"				, Истина);
		НастройкиСинхронизацииТоваров.Вставить("ВыгружатьКартинкиИФайлы"		, Истина);
		
		
		КомпоновщикНастроекКомпоновкиДанныхТоваров = Новый КомпоновщикНастроекКомпоновкиДанных;		
		АдресСхемы = ПоместитьВоВременноеХранилище(СтруктураССхемами.Товары, УникальныйИдентификатор);
		КомпоновщикНастроекКомпоновкиДанныхТоваров.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
		КомпоновщикНастроекКомпоновкиДанныхТоваров.ЗагрузитьНастройки(СтруктураССхемами.Товары.НастройкиПоУмолчанию);
		
		НастройкиСинхронизацииТоваров.Вставить("НастройкиКомпоновкиДанныхТоваров"	, КомпоновщикНастроекКомпоновкиДанныхТоваров.ПолучитьНастройки());
		
		
		СтавкиНДС = Новый ТаблицаЗначений;
		СтавкиНДС.Колонки.Добавить("НаименованиеСтавкиНДС");
		СтавкиНДС.Колонки.Добавить("ИдСтавки");
		СтавкиНДС.Колонки.Добавить("СтавкаНДС");
		
		НастройкиСинхронизацииТоваров.Вставить("СтавкиНДС"	, СтавкиНДС);
		
		НастройкиСинхронизацииТоваров.Вставить("ЗагружатьТовары", Истина); 		
		НастройкиСинхронизацииТоваров.Вставить("ОбновлятьТовары", Ложь);
		НастройкиСинхронизацииТоваров.Вставить("ТипЦены"		 , Справочники.ВидыЦен.ВидЦеныПоУмолчанию(Неопределено));
		НастройкиСинхронизацииТоваров.Вставить("Склад"			 , Справочники.Склады.СкладПоУмолчанию());
		
		НастройкиСинхронизацииТоваров.Вставить("ВыгружатьКартинкиИФайлы" , Истина);
		НастройкиСинхронизацииТоваров.Вставить("ЗагружатьКартинкиИФайлы" , Ложь);
		
		НастройкиСинхронизацииТоваров.Вставить("ИдентификаторКаталога" 	, "");
		НастройкиСинхронизацииТоваров.Вставить("ДеревоГрупп" 			, Справочники.Б24_ПользовательскиеГруппыТоваров.ПустаяСсылка());
		
	НастройкиОбмена.Вставить("НастройкиСинхронизацииТоваров", НастройкиСинхронизацииТоваров);
	
	
	///////////////////////////////////////////
	// 			КОНТРАГЕНТЫ					//
	/////////////////////////////////////////
	
	
		СпкПорядокИдентификацииЮ = новый СписокЗначений;
		СпкПорядокИдентификацииЮ.Добавить("Внешний идентификатор");
		
		СпкПорядокИдентификацииФ = новый СписокЗначений;
		СпкПорядокИдентификацииФ.Добавить("Внешний идентификатор");
	
		НастройкиСинхронизацииКонтрагентов = Новый Структура;
		НастройкиСинхронизацииКонтрагентов.Вставить("ПорядокИдентификацииФизЛиц", СпкПорядокИдентификацииФ);
		НастройкиСинхронизацииКонтрагентов.Вставить("ПорядокИдентификацииЮрЛиц"	, СпкПорядокИдентификацииЮ);
		
		
		СпкТипыКонтрагентовДляКомпаний = новый СписокЗначений;
		СпкТипыКонтрагентовДляКомпаний.Добавить(Перечисления.КомпанияЧастноеЛицо.Компания);
		
		СпкТипыКонтрагентовДляКонтактов = новый СписокЗначений;
		СпкТипыКонтрагентовДляКонтактов.Добавить(Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо);
	
		НастройкиСинхронизацииКонтрагентов.Вставить("ТипыКонтрагентовДляКомпаний"	, СпкТипыКонтрагентовДляКомпаний);
		НастройкиСинхронизацииКонтрагентов.Вставить("ТипыКонтрагентовДляКонтактов"	, СпкТипыКонтрагентовДляКонтактов);
		
		
		КомпоновщикНастроекКомпоновкиДанныхКонтрагентов = Новый КомпоновщикНастроекКомпоновкиДанных;		
		АдресСхемы = ПоместитьВоВременноеХранилище(СтруктураССхемами.Компании, УникальныйИдентификатор);
		КомпоновщикНастроекКомпоновкиДанныхКонтрагентов.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
		КомпоновщикНастроекКомпоновкиДанныхКонтрагентов.ЗагрузитьНастройки(СтруктураССхемами.Компании.НастройкиПоУмолчанию);
		
		НастройкиСинхронизацииКонтрагентов.Вставить("НастройкиКомпоновкиДанныхКонтрагентов"	, КомпоновщикНастроекКомпоновкиДанныхКонтрагентов.ПолучитьНастройки());
		
		тзнПресеты = Новый ТаблицаЗначений;
		тзнПресеты.Колонки.Добавить("НаименованиеШаблона");
		тзнПресеты.Колонки.Добавить("ИдШаблона");
		тзнПресеты.Колонки.Добавить("ТипКонтрагента");
		
		НастройкиСинхронизацииКонтрагентов.Вставить("Пресеты", тзнПресеты);
		
		НастройкиСинхронизацииКонтрагентов.Вставить("ЗагружатьКонтрагентов"	, Истина);
		НастройкиСинхронизацииКонтрагентов.Вставить("ВыгружатьКонтрагентов"	, Истина);
		НастройкиСинхронизацииКонтрагентов.Вставить("ОбновлятьКонтрагентов"	, Истина);
		НастройкиСинхронизацииКонтрагентов.Вставить("ГруппаДляНовыхКонтрагентов", Справочники.Контрагенты.ПустаяСсылка());
		
		НастройкиСинхронизацииКонтрагентов.Вставить("ВыгружатьПользовательскиеПоляКомпанийИКонтактов", Истина);
		НастройкиСинхронизацииКонтрагентов.Вставить("ЗагружатьПользовательскиеПоляКомпанийИКонтактов", Истина);
		
	НастройкиОбмена.Вставить("НастройкиСинхронизацииКонтрагентов", НастройкиСинхронизацииКонтрагентов);
	
	
	///////////////////////////////////////////
	// 				СЧЕТА			  		//
	/////////////////////////////////////////
	
		НастройкиСинхронизацииСчетов = Новый Структура;
		НастройкиСинхронизацииСчетов.Вставить("ЗагружатьСчета"	, Истина);
		НастройкиСинхронизацииСчетов.Вставить("ВыгружатьСчета"	, Истина);
		НастройкиСинхронизацииСчетов.Вставить("ОбновлятьСчета"	, Истина);
		
		НастройкиСинхронизацииСчетов.Вставить("ЗагружатьПользовательскиеПоляСчетов", Истина);
		НастройкиСинхронизацииСчетов.Вставить("ВыгружатьПользовательскиеПоляСчетов", Истина);
		
		НастройкиСинхронизацииСчетов.Вставить("Подразделение"	, Справочники.СтруктураПредприятия.ПустаяСсылка());

		НастройкиСинхронизацииСчетов.Вставить("ДатаНачалаЗагрузкиСчетов"	, ТекущаяДата()- 60*60*24*30);
		НастройкиСинхронизацииСчетов.Вставить("ДатаНачалаВыгрузкиСчетов"	, ТекущаяДата()- 60*60*24*30);
		
		НастройкиСинхронизацииСчетов.Вставить("ИсточникДатыДокумента"		, "Автоматически в 1С");
		НастройкиСинхронизацииСчетов.Вставить("ИсточникНомераДокумента"		, "Автоматически в 1С");
		НастройкиСинхронизацииСчетов.Вставить("РежимЗаписиДокумента"		, "Проводить оплаченные");
		
		ПечатныеФормыСчетов = Новый ТаблицаЗначений;
		ПечатныеФормыСчетов.Колонки.Добавить("НаименованиеПечатнойФормы");
		ПечатныеФормыСчетов.Колонки.Добавить("ИдПечатнойФормы");
		ПечатныеФормыСчетов.Колонки.Добавить("Используется");
		ПечатныеФормыСчетов.Колонки.Добавить("ТипКлиента");
		ПечатныеФормыСчетов.Колонки.Добавить("Организация");
		
		НастройкиСинхронизацииСчетов.Вставить("ПечатныеФормыСчетов", ПечатныеФормыСчетов);
		
		КомпоновщикНастроекКомпоновкиДанныхСчетов = Новый КомпоновщикНастроекКомпоновкиДанных;		
		АдресСхемы = ПоместитьВоВременноеХранилище(СтруктураССхемами.Счета, УникальныйИдентификатор);
		КомпоновщикНастроекКомпоновкиДанныхСчетов.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
		КомпоновщикНастроекКомпоновкиДанныхСчетов.ЗагрузитьНастройки(СтруктураССхемами.Счета.НастройкиПоУмолчанию);
		
		НастройкиСинхронизацииСчетов.Вставить("НастройкиКомпоновкиДанныхСчетов"	, КомпоновщикНастроекКомпоновкиДанныхСчетов.ПолучитьНастройки());
		
	НастройкиОбмена.Вставить("НастройкиСинхронизацииСчетов", НастройкиСинхронизацииСчетов);
	
	
	///////////////////////////////////////////
	// 				СДЕЛКИ			 		//
	/////////////////////////////////////////
	
		НастройкиСинхронизацииСделок = Новый Структура;
		НастройкиСинхронизацииСделок.Вставить("ЗагружатьСделки"	, Истина);
		НастройкиСинхронизацииСделок.Вставить("ВыгружатьСделки"	, Истина);
		НастройкиСинхронизацииСделок.Вставить("ОбновлятьСделки"	, Истина);
		
		НастройкиСинхронизацииСделок.Вставить("ЗагружатьПользовательскиеПоляСделок"	, Истина);
		НастройкиСинхронизацииСделок.Вставить("ВыгружатьПользовательскиеПоляСделок"	, Истина);
		
		
		НастройкиСинхронизацииСделок.Вставить("Подразделение"	, Справочники.СтруктураПредприятия.ПустаяСсылка());
		НастройкиСинхронизацииСделок.Вставить("Организация"		, Справочники.Организации.ОрганизацияПоУмолчанию());
		НастройкиСинхронизацииСделок.Вставить("Соглашение"		, Справочники.СоглашенияСКлиентами.ПустаяСсылка());
		
		НастройкиСинхронизацииСделок.Вставить("ДатаНачалаЗагрузкиСделок"	, ТекущаяДата()- 60*60*24*30);
		НастройкиСинхронизацииСделок.Вставить("ДатаНачалаВыгрузкиСделок"	, ТекущаяДата()- 60*60*24*30);
		НастройкиСинхронизацииСделок.Вставить("ИсточникДатыДокумента"		, "Автоматически в 1С");
		НастройкиСинхронизацииСделок.Вставить("ИсточникНомераДокумента"		, "Автоматически в 1С");
		НастройкиСинхронизацииСделок.Вставить("РежимЗаписиДокумента"		, "Проводить закрытые");
		
		
		КомпоновщикНастроекКомпоновкиДанныхСделок = Новый КомпоновщикНастроекКомпоновкиДанных;		
		АдресСхемы = ПоместитьВоВременноеХранилище(СтруктураССхемами.Сделки, УникальныйИдентификатор);
		КомпоновщикНастроекКомпоновкиДанныхСделок.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
		КомпоновщикНастроекКомпоновкиДанныхСделок.ЗагрузитьНастройки(СтруктураССхемами.Сделки.НастройкиПоУмолчанию);		
		
		НастройкиСинхронизацииСделок.Вставить("НастройкиКомпоновкиДанныхСделок"	, КомпоновщикНастроекКомпоновкиДанныхСделок.ПолучитьНастройки());
		
	НастройкиОбмена.Вставить("НастройкиСинхронизацииСделок", НастройкиСинхронизацииСделок);	
	
	///////////////////////////////////////////
	// 				ЗАКАЗЫ			 		//
	/////////////////////////////////////////
	
		НастройкиСинхронизацииЗаказов = Новый Структура;
		НастройкиСинхронизацииЗаказов.Вставить("ЗагружатьЗаказы"	, Истина);
		НастройкиСинхронизацииЗаказов.Вставить("ВыгружатьЗаказы"	, Истина);
		НастройкиСинхронизацииЗаказов.Вставить("ОбновлятьДокументы"	, Истина);
		
		НастройкиСинхронизацииЗаказов.Вставить("ЗагружатьПользовательскиеПоляЗаказов"	, Истина);
		НастройкиСинхронизацииЗаказов.Вставить("ВыгружатьПользовательскиеПоляЗаказов"	, Истина);		
		
		НастройкиСинхронизацииЗаказов.Вставить("Подразделение"	, Справочники.СтруктураПредприятия.ПустаяСсылка());
		НастройкиСинхронизацииЗаказов.Вставить("Организация"	, Справочники.Организации.ОрганизацияПоУмолчанию());
		НастройкиСинхронизацииЗаказов.Вставить("Соглашение"		, Справочники.СоглашенияСКлиентами.ПустаяСсылка());
		НастройкиСинхронизацииЗаказов.Вставить("ВидЗаказа"		, Неопределено);
		НастройкиСинхронизацииЗаказов.Вставить("Ответственный"	, Справочники.Пользователи.ПустаяСсылка());	
		
		НастройкиСинхронизацииЗаказов.Вставить("ДатаНачалаЗагрузкиЗаказов"	, ТекущаяДата()- 60*60*24*30);
		НастройкиСинхронизацииЗаказов.Вставить("ДатаНачалаВыгрузкиЗаказов"	, ТекущаяДата()- 60*60*24*30);
		НастройкиСинхронизацииЗаказов.Вставить("ИсточникДатыДокумента"		, "Автоматически в 1С");
		НастройкиСинхронизацииЗаказов.Вставить("ИсточникНомераДокумента"	, "Автоматически в 1С");
		НастройкиСинхронизацииЗаказов.Вставить("РежимЗаписиДокумента"		, "Проводить закрытые");
		НастройкиСинхронизацииЗаказов.Вставить("КогдаОтменен"				, "Помечать на удаление");		
		НастройкиСинхронизацииЗаказов.Вставить("Склад"						, Справочники.Склады.СкладПоУмолчанию());		
		НастройкиСинхронизацииЗаказов.Вставить("НоменклатураДоставка"		, Справочники.Номенклатура.ПустаяСсылка());		
		
		
		НастройкиСинхронизацииЗаказов.Вставить("ЗагружатьОплаты"		, Истина);
		НастройкиСинхронизацииЗаказов.Вставить("ВыгружатьОплаты"		, Истина);
		НастройкиСинхронизацииЗаказов.Вставить("ПроводитьЕслиОплачен"	, Истина);		
		НастройкиСинхронизацииЗаказов.Вставить("СтатьяДДС"				, Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());		
		НастройкиСинхронизацииЗаказов.Вставить("СтавкаНДСРасшифровки"	, Неопределено);		
		
		НастройкиСинхронизацииЗаказов.Вставить("ЗагружатьОтгрузки"		, Ложь);
		НастройкиСинхронизацииЗаказов.Вставить("ВыгружатьОтгрузки"		, Истина);
		НастройкиСинхронизацииЗаказов.Вставить("ПроводитьЕслиОтгружен"	, Ложь);
		
		НастройкиСинхронизацииЗаказов.Вставить("ВыгружатьОфлайнЗаказы"	, Ложь);
			
		КомпоновщикНастроекКомпоновкиДанныхЗаказов = Новый КомпоновщикНастроекКомпоновкиДанных;		
		АдресСхемы = ПоместитьВоВременноеХранилище(СтруктураССхемами.Заказы, УникальныйИдентификатор);
		КомпоновщикНастроекКомпоновкиДанныхЗаказов.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
		КомпоновщикНастроекКомпоновкиДанныхЗаказов.ЗагрузитьНастройки(СтруктураССхемами.Заказы.НастройкиПоУмолчанию);		
		
		НастройкиСинхронизацииЗаказов.Вставить("НастройкиКомпоновкиДанныхЗаказов"	, КомпоновщикНастроекКомпоновкиДанныхЗаказов.ПолучитьНастройки());
		
	НастройкиОбмена.Вставить("НастройкиСинхронизацииЗаказов", НастройкиСинхронизацииЗаказов);
		
	Возврат НастройкиОбмена;
	
КонецФункции

#КонецОбласти
